/*
Задание №5

Дано:
Библиотека super-date, которая имеет ряд функций для работы с датой
и временем. Текущая версия библиотеки 1.4.2
Разработчики подготовили новый релиз библиотеки со следующим
списком изменений:
- Поправлена ошибка в функции .toISODate(), при которой функция
возвращала некорректный формат даты.
- Исправлены мелкие ошибки в расчетах даты и времени в ряде
функций: toLocaleDate(), getYesterday(), getTomorrow()
- Поправлены проблемы с работой функций на версиях Node.js
ниже 16.0.0
Задача: Определить, как должна обновиться версия библиотеки в
связи с вышеперечисленными изменениями
*/

// Ответ:  v1.4.3