/*
Задание №7

Дано:
Библиотека super-date. Текущая версия 2.0.0
Разработчики подготовили новый релиз библиотеки со следующим
списком изменений:
- Добавлен метод .addDays() для добавления указанного
количества дней к текущей дате.
- Поправлены некоторые ошибки в расчете дат в ряде методов:
getYesterday(), getTomorrow()
- Теперь в конструктор класса SuperDate можно не пробрасывать
объект даты new Date(). Если объект класса Date не будет
передан, то он инициализируется автоматически внутри
конструктора
Задача: Определить, как должна обновиться версия библиотеки в
связи с вышеперечисленными изменениями*/

// Ответ: v2.1.0